tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Arbitrary precision calculator
brew "calc"
# C++ interpreter
brew "cling"
# Parallels Driver for Docker Machine
brew "docker-machine-parallels"
# .NET Core
brew "dotnet"
# Modern replacement for 'ls'
brew "exa"
# Read, write, modify, and display EXIF data on the command-line
brew "exif"
# Perl lib for reading and writing EXIF metadata
brew "exiftool"
# Interactive shell for FaunaDB
brew "fauna-shell"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# Command-line JSON processing tool
brew "fx"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Simplified Go project management, dependency management, and vendoring
brew "glide"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Improved top (interactive process viewer)
brew "htop"
# Next-gen compiler infrastructure
brew "llvm"
# List USB devices, just like the Linux lsusb command
brew "lsusb"
# Port scanning utility for large networks
brew "nmap"
# Manage multiple Node.js versions
brew "nvm"
# Development kit for the Java programming language
brew "openjdk"
# GNOME Python bindings (based on GObject Introspection)
brew "pygobject3"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Command-line interface to the freedesktop.org trashcan
brew "trash-cli"
# Language for application scale JavaScript development
brew "typescript"
# Internet file retriever
brew "wget"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
cask "anaconda"
# Tools for building Android applications
cask "android-studio"
# Two-factor authentication software
cask "authy"
cask "background-music"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Browser for SQLite databases
cask "db-browser-for-sqlite"
# Voice and text chat software
cask "discord"
# App to build and share containerized applications and microservices
cask "docker"
# Draw.io is free online diagram software
cask "drawio"
# Web browser
cask "firefox"
cask "font-fira-code"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Set of tools to manage resources and applications hosted on Google Cloud
cask "google-cloud-sdk"
cask "google-drive-file-stream"
# System monitoring app
cask "istat-menus"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
cask "microsoft-office"
cask "microsoft-teams"
# Tool to scan and monitor the network
cask "network-radar"
# Desktop virtualization software
cask "parallels"
cask "parallels-access"
cask "parallels-client"
# Bundle with over 30 tools
cask "parallels-toolbox"
# Desktop virtualization development kit
cask "parallels-virtualization-sdk"
# Collaboration platform for API development
cask "postman"
# Environment for statistical computing and graphics
cask "r"
cask "raspberry-pi-imager"
# Safari version of the Refined Github extension
cask "refined-github-safari"
# Collection of apps available by subscription
cask "setapp"
# Video chat, voice call and instant messaging application
cask "skype"
# Team communication and collaboration software
cask "slack"
# Application to control your PlayStation 4
cask "sony-ps4-remote-play"
# Music streaming service
cask "spotify"
# Temperature monitoring, fan control and diagnostics
cask "tg-pro"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
